Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.14 inch LCD Display/ESP32-S3 Plus/0703_DashBoard_114_ESP32/0703_DashBoard_114_ESP32.ino
/**
 * Product: XIAO 1.14 inch LCD Board (ST7789 135x240 IPS, no touch)
 * Display: ST7789 135x240, RGB, no touch
 * Target:  XIAO ESP32-S3 Plus (RST=13, BL=12). For nRF52840 Plus use the sibling
 *          nRF52840 Plus folder (RST=38, BL=37).
 * Wiring:  CS=D2, DC=D3, MOSI=D10, SCLK=D8; RST=13, BL=12.
 * Demo:    1.14 ESP32-S3 factory dashboard: I2S PDM mic VU, IMU auto-detect (QMI8658 or
 *          LSM6DS3) with double-tap, Grove I2C step-scan, 3 user buttons, D16 ADC voltage sense.
 *
 * Ported from XIAO-Display-Board-main (0703_DashBoard_114_ESP32, Arduino_GFX). The Seeed_GFX
 * Board/Config templates replace the original bus+panel setup, manual MADCTL/invert/
 * swapbytes, and (for TFT_eSPI) the driver.h User_Setup. Keep ESP32 I2S PDM
 * (driver/i2s_pdm.h, IDF v5 i2s_pdm_rx), I2C IMU auto-detect, Grove step-scan,
 * analogReadMilliVolts, and WiFi.mode(WIFI_OFF) under ESP_IDF_VERSION_MAJOR guards;
 * backlight PWM stays on analogWrite(LCD_BL_PIN).
 */

#include <Arduino.h>
#include <Wire.h>
#include <SPI.h>
#include <WiFi.h>
#include <Seeed_GFX.h>
#include "board/boards/XIAO_LCD_Board.h"
#include "driver/tft/Driver_ST7789.h"
#include "panel/Panel_TFT.h"
#include "esp_idf_version.h"

#if ESP_IDF_VERSION_MAJOR >= 5
  #include <driver/i2s_pdm.h>
#else
  #include <driver/i2s.h>
#endif

#include <driver/gpio.h>
#include <math.h>

// ========================= Build switches =========================

#define REDUCE_PDM_CLK_DRIVE 1

// ========================= Timing =========================

static constexpr uint32_t UI_FAST_MS = 120;
static constexpr uint32_t UI_SLOW_MS = 260;
static constexpr uint32_t UI_VU_MS = 60;
static constexpr uint32_t SERIAL_MS = 600;
static constexpr uint32_t I2C_SCAN_MS = 120;   // step-scan interval, avoids long I2C bursts during Grove hot-plug
static constexpr uint32_t BAT_REFRESH_MS = 350;
static constexpr uint32_t VSENSE_UI_MS = 1000;      // D16/Calc display check interval
static constexpr float VSENSE_D16_DELTA_V = 0.02f; // avoid 0.01V ADC jitter redraw
static constexpr float VSENSE_CALC_DELTA_V = 0.05f;
static constexpr uint32_t BTN_DEBOUNCE_MS = 35;
static constexpr uint32_t BTN_ACTION_LOCKOUT_MS = 150;
static constexpr uint32_t TAP_DEBOUNCE_MS = 220;

// ========================= LCD parameters =========================
// Rotation/IPS/offsets are baked into Config_Seeed_1inch14_LCD_ST7789 (135x240 RGB).

static constexpr int LCD_W = 135;
static constexpr int LCD_H = 240;

// ========================= MIC parameters =========================

static constexpr int MIC_SAMPLE_RATE_HZ = 16000;
static constexpr bool MIC_CLK_INVERT = false;
static constexpr size_t MIC_SAMPLES_PER_READ = 256;

// Display-only scaling, tuned for the 1.14 block VU.
static constexpr float MIC_DISPLAY_SCALE = 2400.0f;

// ========================= Battery =========================
// BAT monitor policy:
//   1. Is a real battery connected?
//   2. If connected, what is the approximate battery percentage?
//   3. Do NOT infer charging state.
// Divider:
//   VBAT -- 316K -- ADC -- 160K -- GND
//   ratio = 476K / 160K = 2.975

static constexpr float BAT_R_TOP_KOHM        = 316.0f;
static constexpr float BAT_R_BOTTOM_KOHM     = 160.0f;
static constexpr float BAT_DIVIDER_RATIO     = (BAT_R_TOP_KOHM + BAT_R_BOTTOM_KOHM) / BAT_R_BOTTOM_KOHM;
static constexpr float BAT_CAL_FACTOR        = 1.000f;

static constexpr float BAT_VALID_MIN_V       = 2.80f;
static constexpr float BAT_VALID_MAX_V       = 4.60f;
static constexpr uint16_t BAT_PRESENT_MIN_MV = 850;
static constexpr uint16_t BAT_FLOAT_RANGE_MV = 90;

static constexpr uint8_t BAT_VALID_CONFIRM_COUNT = 3;
static constexpr uint8_t BAT_INVALID_CONFIRM_COUNT = 3;

// USB-only cold boot guard.
// Observed on 1.47: USB-only can show a stable fake ~70%.
// Trade-off: a real high-SOC battery-only cold boot can also be rejected.
static constexpr bool BAT_COLD_BOOT_HIGH_AS_USB = true;
static constexpr int  BAT_COLD_BOOT_SUSPECT_PCT = 60;

// Reject impossible high jump after a known real battery.
static constexpr float BAT_IMPOSSIBLE_JUMP_V     = 0.28f;
static constexpr int   BAT_IMPOSSIBLE_JUMP_PCT   = 22;
static constexpr uint8_t BAT_FLOAT_REJECT_STREAK = 2;

// Reinsert unlock after FLOAT_LOCK.
static constexpr float BAT_REINSERT_DROP_V       = 0.16f;

// USB-first then battery-insert compensation.
// Observed on 1.47: true 27%, USB-first insertion showed 39%, USB unplug returned to 27%.
static constexpr float BAT_USB_INSERT_SURFACE_COMP_V = 0.085f;
static constexpr float BAT_USB_INSERT_RELEASE_DROP_V = 0.045f;
static constexpr float BAT_EFFECTIVE_MIN_V           = 3.25f;

// UI percentage limiter.
static constexpr uint32_t BAT_PCT_RISE_INTERVAL_MS = 90000;

// ADC sampling.
static constexpr uint8_t BAT_SAMPLE_COUNT = 12;
static constexpr uint16_t BAT_SAMPLE_DELAY_US = 700;

// ========================= Pins =========================

static constexpr uint8_t MIC_CLK_PIN   = D0;
static constexpr uint8_t MIC_DATA_PIN  = D1;
static constexpr uint8_t LCD_CS_PIN    = D2;
static constexpr uint8_t LCD_DC_PIN    = D3;
static constexpr uint8_t I2C_SDA_PIN   = D4;
static constexpr uint8_t I2C_SCL_PIN   = D5;
static constexpr uint8_t BTN_A_PIN     = D6;   // USR1
static constexpr uint8_t BTN_B_PIN     = D7;   // USR2
static constexpr uint8_t LCD_SCK_PIN   = D8;
static constexpr uint8_t LCD_MISO_PIN  = D9;   // NC, unused by LCD
static constexpr uint8_t LCD_MOSI_PIN  = D10;
static constexpr uint8_t I2S_SD_PAD    = D11;
static constexpr uint8_t I2S_SCK_PAD   = D12;
static constexpr uint8_t I2S_WS_PAD    = D13;
static constexpr uint8_t IMU_INT_PIN   = D14;
static constexpr uint8_t BAT_ADC_PIN   = D16;
static constexpr uint8_t BTN_C_PIN     = D19;  // USR3

// ========================= Colors =========================

static constexpr uint16_t C_BLACK   = TFT_BLACK;
static constexpr uint16_t C_WHITE   = TFT_WHITE;
static constexpr uint16_t C_GREEN   = TFT_GREEN;
static constexpr uint16_t C_RED     = TFT_RED;
static constexpr uint16_t C_CYAN    = TFT_CYAN;
static constexpr uint16_t C_YELLOW  = TFT_YELLOW;
static constexpr uint16_t C_ORANGE  = 0xFD20;
static constexpr uint16_t C_GRAY    = 0x8410;
static constexpr uint16_t C_DIM     = 0x2104;
static constexpr uint16_t C_BLUE    = TFT_BLUE;
static constexpr uint16_t C_PANEL   = 0x0841;
static constexpr uint16_t C_LINE    = 0x39E7;

// ========================= LCD object =========================

Seeed_GFX display;

