Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.14 inch LCD Display/ESP32-S3 Plus/0703_DashBoard_114_ESP32/0703_DashBoard_114_ESP32.ino
static constexpr int8_t LCD_RST_PIN = 13;  // XIAO ESP32-S3 Plus
static constexpr int8_t LCD_BL_PIN  = 12;

// ========================= I2S object =========================

#if ESP_IDF_VERSION_MAJOR >= 5
static i2s_chan_handle_t g_i2sRxChan = nullptr;
#else
static constexpr i2s_port_t I2S_PORT = I2S_NUM_0;
#endif

// ========================= State =========================

bool g_lcdOk = false;
bool g_micOk = false;

struct AudioStats {
  int32_t mean;
  uint32_t peak;
  uint32_t rms;
};

AudioStats g_micStats = {};
int16_t g_pdmBuf[MIC_SAMPLES_PER_READ];
uint32_t g_micLastUpdateMs = 0;

enum ImuType {
  IMU_NONE = 0,
  IMU_QMI8658,
  IMU_LSM6DS3
};

ImuType g_imuType = IMU_NONE;
uint8_t g_imuAddr = 0;
bool g_imuOk = false;
float g_ax = 0, g_ay = 0, g_az = 0;
float g_gx = 0, g_gy = 0, g_gz = 0;

// Buttons
bool g_btnA = false;
bool g_btnB = false;
bool g_btnC = false;
int g_btnARaw = HIGH;
int g_btnBRaw = HIGH;
int g_btnCRaw = HIGH;
bool g_btnALastRawPressed = false;
bool g_btnBLastRawPressed = false;
bool g_btnCLastRawPressed = false;
uint32_t g_btnALastChangeMs = 0;
uint32_t g_btnBLastChangeMs = 0;
uint32_t g_btnCLastChangeMs = 0;
bool g_btnAPressEvent = false;
bool g_btnBPressEvent = false;
bool g_btnCPressEvent = false;
uint32_t g_lastBtnActionMs = 0;

// Backlight control
static const uint8_t BL_LEVELS[] = {255, 192, 128, 64, 0};
static const int BL_LABELS[] = {100, 75, 50, 25, 0};
static constexpr uint8_t BL_LEVEL_COUNT = sizeof(BL_LEVELS) / sizeof(BL_LEVELS[0]);
uint8_t g_blIndex = 0;
uint8_t g_blRestoreIndex = 0;

// I2C scan
uint8_t g_i2cDevices[12] = {};
uint8_t g_i2cCount = 0;
uint8_t g_i2cNextDevices[12] = {};
uint8_t g_i2cNextCount = 0;
uint8_t g_i2cScanAddr = 0x08;
bool g_i2cScanFault = false;
uint8_t g_i2cScanFaultCount = 0;

// Battery
struct BatteryState {
  uint16_t raw = 0;
  uint16_t rawMin = 0;
  uint16_t rawMax = 0;

  uint16_t mv = 0;
  uint16_t mvMin = 0;
  uint16_t mvMax = 0;
  uint16_t spreadMv = 0;

  float vadc = 0.0f;
  float rawVbat = 0.0f;
  float vbat = 0.0f;
  int percent = 0;

  bool valid = false;
  const char *state = "BOOT";
};

BatteryState g_bat;
BatteryState g_vsense;       // raw D16 ADC measurement before BAT/USB filtering
BatteryState g_lastGoodBat;

bool g_haveLastGoodBat = false;
uint8_t g_batValidStreak = 0;
uint8_t g_batInvalidStreak = 0;
const char *g_batFilterState = "BOOT";

int g_batDisplayPercent = -1;
uint32_t g_batLastPctRiseMs = 0;

bool g_batFloatReject = false;
uint8_t g_batFloatRejectStreak = 0;
uint8_t g_batReinsertStreak = 0;
float g_batLastRealV = 0.0f;
int g_batLastRealPercent = -1;

uint8_t g_batColdUsbSuspectStreak = 0;

bool g_batUsbOnlySeen = false;
bool g_batUsbInsertCompActive = false;
float g_batUsbInsertRawStartV = 0.0f;

// Tap
volatile bool g_imuIntFlag = false;
bool g_imuTapConfigured = false;
uint32_t g_doubleTapCount = 0;
uint32_t g_lastTapMs = 0;

// UI/cache/timing
uint32_t g_lastFastUiMs = 0;
uint32_t g_lastSlowUiMs = 0;
uint32_t g_lastVuMs = 0;
uint32_t g_lastSerialMs = 0;
uint32_t g_lastI2cMs = 0;
uint32_t g_lastBatMs = 0;
uint32_t g_lastVsenseUiMs = 0;
uint32_t g_frameCounter = 0;

float g_vuSmooth = 0.0f;
int g_cachedVuSegments = -1;

bool g_headerShowSeeed = false;

String cache_micRaw = "";
String cache_acc = "";
String cache_gyr = "";
String cache_tap = "";
String cache_bat = "";
String cache_d16_adc = "";
String cache_d16_calc = "";
float g_d16ShownVadc = -1.0f;
float g_d16ShownCalc = -1.0f;
String cache_grove = "";
String cache_key = "";
String cache_bl = "";
int cache_batIconState = -1;

// ========================= UI layout =========================

static constexpr int ROW_TITLE = 2;
static constexpr int ROW_SUB1  = 21;

static constexpr int CARD_X = 3;
static constexpr int CARD_W = 129;

static constexpr int Y_SYS = 36;
static constexpr int H_SYS = 38;
static constexpr int ROW_SYS_TITLE = Y_SYS + 9;
static constexpr int ROW_BAT = ROW_SYS_TITLE;
static constexpr int ROW_GROVE = Y_SYS + 25;

static constexpr int Y_IMU = 79;
static constexpr int H_IMU = 50;
static constexpr int ROW_IMU_TITLE = Y_IMU + 9;
static constexpr int ROW_TAP = Y_IMU + 9;
static constexpr int ROW_ACC = Y_IMU + 25;
static constexpr int ROW_GYR = Y_IMU + 39;

static constexpr int Y_MIC = 134;
static constexpr int H_MIC = 45;
static constexpr int ROW_MIC_TITLE = Y_MIC + 9;
static constexpr int ROW_MIC_RAW   = Y_MIC + 32;

static constexpr int VU_X = CARD_X + 14;
static constexpr int VU_Y = Y_MIC + 21;
static constexpr int VU_W = 110;
static constexpr int VU_H = 10;
static constexpr int VU_SEG_COUNT = 12;
static constexpr int VU_GAP = 2;
static constexpr int VU_SEG_W = (VU_W - 4 - (VU_SEG_COUNT - 1) * VU_GAP) / VU_SEG_COUNT;

static constexpr int Y_BL = 182;
static constexpr int H_BL = 31;
static constexpr int ROW_BL = Y_BL + 19;
static constexpr int ROW_PRODUCT = 222;

static constexpr int BAT_ICON_X = 62;
static constexpr int BAT_ICON_Y = ROW_BAT - 2;
static constexpr int BAT_ICON_W = 18;
static constexpr int BAT_ICON_H = 10;

// D16 voltage row is narrow on the 1.14-inch UI. Use one compact full-row
// string and clear the whole inner row before drawing to avoid residual pixels.
static constexpr int VSENSE_ROW_X = 7;
static constexpr int VSENSE_ROW_W = 122;
static constexpr int VSENSE_ROW_CHARS = 20;

// ========================= Helpers =========================

static int16_t le16(const uint8_t *p) {
  return (int16_t)((uint16_t)p[0] | ((uint16_t)p[1] << 8));
}

static bool i2cWrite8(uint8_t addr, uint8_t reg, uint8_t val) {
  Wire.beginTransmission(addr);
  Wire.write(reg);
  Wire.write(val);
  return Wire.endTransmission() == 0;
}

static bool i2cRead(uint8_t addr, uint8_t reg, uint8_t *buf, size_t len) {
  Wire.beginTransmission(addr);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return false;

  size_t got = Wire.requestFrom((int)addr, (int)len);
  if (got != len) return false;

  for (size_t i = 0; i < len; i++) {
    buf[i] = Wire.read();
  }
  return true;
}

static bool i2cRead8(uint8_t addr, uint8_t reg, uint8_t *val) {
  return i2cRead(addr, reg, val, 1);
}

static String padRight(const String &s, int width) {
  String out = s;
  while ((int)out.length() < width) out += ' ';
  if ((int)out.length() > width) out = out.substring(0, width);
  return out;
}

static uint16_t colorByPercent(int p) {
  if (p < 15) return C_RED;
  if (p < 35) return C_ORANGE;
  if (p < 60) return C_YELLOW;
  return C_GREEN;
}

static int lipoPercent(float v) {
  struct Point { float v; int p; };
  static const Point table[] = {
    {4.20f, 100},
    {4.10f, 90},
    {4.00f, 80},
    {3.92f, 70},
    {3.85f, 60},
    {3.79f, 50},
    {3.72f, 40},
    {3.66f, 30},
    {3.58f, 20},
    {3.50f, 10},
    {3.30f, 0}
  };

  if (v >= table[0].v) return 100;
  if (v <= table[10].v) return 0;

  for (int i = 0; i < 10; i++) {
    if (v <= table[i].v && v >= table[i + 1].v) {
      float t = (v - table[i + 1].v) / (table[i].v - table[i + 1].v);
      return table[i + 1].p + (int)roundf(t * (table[i].p - table[i + 1].p));
    }
  }

