Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.14 inch LCD Display/ESP32-S3 Plus/0703_DashBoard_114_ESP32/0703_DashBoard_114_ESP32.ino
  return 0;
}

static uint8_t currentBacklightPwm() {
  return BL_LEVELS[g_blIndex];
}

static int currentBacklightPercent() {
  return BL_LABELS[g_blIndex];
}

static void applyBacklight() {
  pinMode(LCD_BL_PIN, OUTPUT);
  analogWrite(LCD_BL_PIN, currentBacklightPwm());
}

static void cycleBacklightLevel() {
  g_blIndex = (g_blIndex + 1) % BL_LEVEL_COUNT;
  if (currentBacklightPwm() > 0) {
    g_blRestoreIndex = g_blIndex;
  }
  applyBacklight();
}

static void toggleBacklightOffRestore() {
  if (currentBacklightPwm() == 0) {
    if (BL_LEVELS[g_blRestoreIndex] == 0) g_blRestoreIndex = 0;
    g_blIndex = g_blRestoreIndex;
  } else {
    g_blRestoreIndex = g_blIndex;
    g_blIndex = BL_LEVEL_COUNT - 1;
  }
  applyBacklight();
}

// ========================= LCD / UI drawing =========================
// Seeed_GFX owns the SPI bus/CS via the Board template, so the former
// acquireForLcd()/LCD_CS_PIN manual arbitration is no longer needed here.

static bool initLcd() {
  if (!display.begin<Board_XIAO_1inch14_LCD<LCD_RST_PIN, LCD_BL_PIN>,
                   Config_Seeed_1inch14_LCD_ST7789>()) {
    g_lcdOk = false;
    Serial.println(display.lastResult().message);
    return false;
  }

  applyBacklight();  // establish initial PWM brightness (Board template already drove RST+BL on)

  display.fillScreen(C_BLACK);
  display.setTextWrap(false);

  g_lcdOk = true;
  Serial.println("[LCD] OK 1.14 ST7789 135x240");
  return true;
}

static bool printTextFixed(int x, int y, uint16_t color, const String &s, int widthChars) {
  if (!g_lcdOk) return false;
  display.setTextSize(1);
  display.setTextColor(color, C_BLACK);
  display.setCursor(x, y);
  display.print(padRight(s, widthChars));
  return true;
}

static void drawCard(int x, int y, int w, int h, uint16_t accent, const char *title) {
  if (!g_lcdOk) return;
  display.drawRoundRect(x, y, w, h, 5, accent);
  display.drawRoundRect(x + 1, y + 1, w - 2, h - 2, 5, C_LINE);
  display.fillRect(x + 4, y + 9, 3, h - 18, accent);
  display.setTextSize(1);
  display.setTextColor(accent, C_BLACK);
  display.setCursor(x + 12, y + 8);
  display.print(title);
}

static void drawVuFrame() {
  if (!g_lcdOk) return;
  display.drawRoundRect(VU_X, VU_Y, VU_W, VU_H, 3, C_GREEN);
  for (int i = 0; i < VU_SEG_COUNT; ++i) {
    int x = VU_X + 2 + i * (VU_SEG_W + VU_GAP);
    display.fillRect(x, VU_Y + 2, VU_SEG_W, VU_H - 4, C_BLACK);
  }
}

static bool drawBatteryIcon(bool valid, int percent) {
  if (!g_lcdOk) return false;

  int x = BAT_ICON_X;
  int y = BAT_ICON_Y;
  display.fillRect(x - 1, y - 1, BAT_ICON_W + 5, BAT_ICON_H + 2, C_BLACK);

  uint16_t outline = valid ? C_WHITE : C_GRAY;
  uint16_t fillColor = valid ? colorByPercent(percent) : C_RED;

  display.drawRoundRect(x, y, BAT_ICON_W, BAT_ICON_H, 2, outline);
  display.fillRect(x + BAT_ICON_W, y + 3, 3, 4, outline);

  if (!valid) {
    display.drawLine(x + 3, y + 2, x + BAT_ICON_W - 3, y + BAT_ICON_H - 3, C_RED);
    display.drawLine(x + BAT_ICON_W - 3, y + 2, x + 3, y + BAT_ICON_H - 3, C_RED);
    return true;
  }

  int fillW = map(percent, 0, 100, 0, BAT_ICON_W - 4);
  fillW = constrain(fillW, 0, BAT_ICON_W - 4);
  if (fillW > 0) display.fillRect(x + 2, y + 2, fillW, BAT_ICON_H - 4, fillColor);
  return true;
}

static void drawHeaderTitle() {
  if (!g_lcdOk) return;
  display.fillRect(0, 0, LCD_W, 20, C_BLACK);
  display.setTextColor(C_GREEN, C_BLACK);

  if (g_headerShowSeeed) {
    display.setTextSize(2);
    display.setCursor(37, ROW_TITLE);
    display.print("Seeed");
  } else {
    display.setTextSize(2);
    display.setCursor(1, ROW_TITLE);
    display.print("Hello,XIAO!");
  }
}

static void drawStaticLayout() {
  if (!g_lcdOk) return;
  display.fillScreen(C_BLACK);

  drawHeaderTitle();

  display.setTextSize(1);
  display.setTextColor(C_CYAN, C_BLACK);
  display.setCursor(6, ROW_SUB1);
  display.print("1.14 Inch Display");
  display.drawFastHLine(6, 31, 123, C_LINE);

  drawCard(CARD_X, Y_SYS, CARD_W, H_SYS, C_CYAN, "SYS");
  display.setTextColor(C_WHITE, C_BLACK);
  // D16 row is drawn as one compact dynamic line by updateUiFast().
  display.setCursor(14, ROW_GROVE);
  display.print("I2C");

  drawCard(CARD_X, Y_IMU, CARD_W, H_IMU, C_YELLOW, "MOTION");
  display.setTextColor(C_YELLOW, C_BLACK);
  display.setCursor(88, ROW_TAP);
  display.print("Tap 0");
  display.setTextColor(C_WHITE, C_BLACK);
  display.setCursor(14, ROW_ACC);
  display.print("A");
  display.setCursor(14, ROW_GYR);
  display.print("G");

  drawCard(CARD_X, Y_MIC, CARD_W, H_MIC, C_GREEN, "MIC LEVEL");
  drawVuFrame();

  drawCard(CARD_X, Y_BL, CARD_W, H_BL, C_BLUE, "BACKLIGHT");

  display.fillRect(0, ROW_PRODUCT - 1, LCD_W, 12, C_BLACK);
  display.setTextColor(C_YELLOW, C_BLACK);
  display.setCursor(13, ROW_PRODUCT);
  display.print("XIAO ESP32-S3 Plus");

  cache_micRaw = "";
  cache_acc = "";
  cache_gyr = "";
  cache_tap = "";
  cache_bat = "";
  cache_d16_adc = "";
  cache_d16_calc = "";
  g_d16ShownVadc = -1.0f;
  g_d16ShownCalc = -1.0f;
  cache_grove = "";
  cache_key = "";
  cache_bl = "";
  cache_batIconState = -1;
  g_cachedVuSegments = -1;
}

// ========================= I2C / IMU =========================

static void printI2cScanResult() {
  Serial.print("[I2C] scan:");
  if (!g_i2cCount) {
    Serial.print(" none");
  } else {
    for (uint8_t i = 0; i < g_i2cCount; i++) {
      Serial.printf(" 0x%02X", g_i2cDevices[i]);
    }
  }
  if (g_i2cScanFaultCount) {
    Serial.printf(" faultCount=%u", g_i2cScanFaultCount);
  }
  Serial.println();
}

static void abortI2cStepScan(uint8_t addr, uint8_t err) {
  // Do not call Wire.end() / pinMode(SDA/SCL) during runtime on ESP32.
  // That can disturb the I2C pin matrix and may make the onboard IMU disappear
  // or cause visible LCD/backlight glitches during Grove hot-plug.
  g_i2cNextCount = 0;
  g_i2cScanAddr = 0x08;
  g_i2cScanFault = true;
  if (g_i2cScanFaultCount < 255) g_i2cScanFaultCount++;

  Serial.printf("[I2C] step scan abort addr=0x%02X err=%u, keep previous result, faultCount=%u\n",
                addr, err, g_i2cScanFaultCount);
}

static void scanI2cBus() {
  // Step scan instead of full-range burst scan.
  // Each call probes a small address batch, so Grove hot-plug cannot block or
  // disturb the UI for a long continuous I2C transaction window.
  static constexpr uint8_t I2C_SCAN_BATCH = 8;

  for (uint8_t n = 0; n < I2C_SCAN_BATCH; n++) {
    if (g_i2cScanAddr > 0x77) {
      g_i2cCount = g_i2cNextCount;
      for (uint8_t i = 0; i < g_i2cCount; i++) {
        g_i2cDevices[i] = g_i2cNextDevices[i];
      }

