Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.14 inch LCD Display/ESP32-S3 Plus/0703_DashBoard_114_ESP32/0703_DashBoard_114_ESP32.ino
  uint32_t now = millis();
  if (now - g_lastBtnActionMs < BTN_ACTION_LOCKOUT_MS) return;
  g_lastBtnActionMs = now;

  if (doB) {
    toggleBacklightOffRestore();
    Serial.print("[BTN] USR2 toggle brightness pwm=");
    Serial.print((unsigned)currentBacklightPwm());
    Serial.print(" label=");
    Serial.print(currentBacklightPercent());
    Serial.println("%");
    return;
  }

  if (doA) {
    cycleBacklightLevel();
    Serial.print("[BTN] USR1 cycle brightness pwm=");
    Serial.print((unsigned)currentBacklightPwm());
    Serial.print(" label=");
    Serial.print(currentBacklightPercent());
    Serial.println("%");
    return;
  }

  if (doC) {
    g_headerShowSeeed = !g_headerShowSeeed;
    drawHeaderTitle();
    Serial.print("[BTN] USR3 header=");
    Serial.println(g_headerShowSeeed ? "Seeed" : "Hello,XIAO!");
  }
}

// ========================= Battery =========================

static uint16_t readBatteryMilliVolts() {
  return (uint16_t)analogReadMilliVolts(BAT_ADC_PIN);
}

static BatteryState readBatteryMeasured() {
  BatteryState r;

  uint32_t rawSum = 0;
  uint32_t mvSum = 0;
  uint16_t rawMin = 65535;
  uint16_t rawMax = 0;
  uint16_t mvMin = 65535;
  uint16_t mvMax = 0;

  for (uint8_t i = 0; i < BAT_SAMPLE_COUNT; i++) {
    uint16_t raw = (uint16_t)analogRead(BAT_ADC_PIN);
    uint16_t mv = readBatteryMilliVolts();

    rawSum += raw;
    mvSum += mv;

    if (raw < rawMin) rawMin = raw;
    if (raw > rawMax) rawMax = raw;
    if (mv < mvMin) mvMin = mv;
    if (mv > mvMax) mvMax = mv;

    delayMicroseconds(BAT_SAMPLE_DELAY_US);
  }

  r.raw = rawSum / BAT_SAMPLE_COUNT;
  r.rawMin = rawMin;
  r.rawMax = rawMax;

  r.mv = mvSum / BAT_SAMPLE_COUNT;
  r.mvMin = mvMin;
  r.mvMax = mvMax;
  r.spreadMv = mvMax - mvMin;

  r.vadc = r.mv / 1000.0f;
  r.rawVbat = r.vadc * BAT_DIVIDER_RATIO * BAT_CAL_FACTOR;
  r.vbat = r.rawVbat;
  r.percent = lipoPercent(r.vbat);
  r.valid = false;
  r.state = "MEASURED";

  return r;
}

static int updatePresencePercent(int measuredPercent, bool freshBattery) {
  measuredPercent = constrain(measuredPercent, 0, 100);
  uint32_t now = millis();

  if (freshBattery || g_batDisplayPercent < 0) {
    g_batDisplayPercent = measuredPercent;
    g_batLastPctRiseMs = now;
    return g_batDisplayPercent;
  }

  if (measuredPercent < g_batDisplayPercent) {
    g_batDisplayPercent = measuredPercent;
    return g_batDisplayPercent;
  }

  if (measuredPercent > g_batDisplayPercent &&
      (now - g_batLastPctRiseMs >= BAT_PCT_RISE_INTERVAL_MS)) {
    g_batDisplayPercent++;
    g_batLastPctRiseMs = now;
  }

  return g_batDisplayPercent;
}

static bool isImpossibleHighJump(const BatteryState &m) {
  if (!g_haveLastGoodBat) return false;

  float dv = m.rawVbat - g_lastGoodBat.rawVbat;
  int dp = m.percent - g_lastGoodBat.percent;

  return (dv >= BAT_IMPOSSIBLE_JUMP_V) || (dp >= BAT_IMPOSSIBLE_JUMP_PCT);
}

static bool isColdBootUsbSuspect(const BatteryState &m, bool stable) {
  if (!BAT_COLD_BOOT_HIGH_AS_USB) return false;
  if (g_haveLastGoodBat) return false;
  if (!stable) return false;
  return (m.percent >= BAT_COLD_BOOT_SUSPECT_PCT);
}

static void markBatteryAbsentLikeUsb(const BatteryState &measured, const char *stateName) {
  g_batUsbOnlySeen = true;
  g_batUsbInsertCompActive = false;
  g_batUsbInsertRawStartV = 0.0f;

  g_bat = measured;
  g_bat.valid = false;
  g_bat.percent = 0;
  g_bat.vbat = measured.rawVbat;
  g_bat.state = stateName;
  g_batFilterState = stateName;

  cache_bat = "";
  cache_batIconState = -1;
}

static float batteryEffectiveVoltageForPercent(float rawV, bool freshBattery) {
  if (freshBattery && g_batUsbOnlySeen && !g_batUsbInsertCompActive) {
    g_batUsbInsertCompActive = true;
    g_batUsbInsertRawStartV = rawV;

    Serial.print("[BAT] USB-first battery insert compensation ON rawStart=");
    Serial.println(g_batUsbInsertRawStartV, 3);
  }

  if (g_batUsbInsertCompActive) {
    if (g_batUsbInsertRawStartV > 0.0f &&
        rawV <= (g_batUsbInsertRawStartV - BAT_USB_INSERT_RELEASE_DROP_V)) {
      g_batUsbInsertCompActive = false;

      Serial.print("[BAT] USB-insert compensation OFF raw=");
      Serial.println(rawV, 3);

      return rawV;
    }

    float compensated = rawV - BAT_USB_INSERT_SURFACE_COMP_V;
    if (compensated < BAT_EFFECTIVE_MIN_V) compensated = BAT_EFFECTIVE_MIN_V;
    return compensated;
  }

  return rawV;
}

static void updateBattery() {
  BatteryState measured = readBatteryMeasured();

  // UI reports voltage sense data, not battery presence.
  // Keep raw measured values before BAT/USB filtering or percentage smoothing.
  g_vsense = measured;

  bool plausible = (measured.mv >= BAT_PRESENT_MIN_MV &&
                    measured.rawVbat >= BAT_VALID_MIN_V &&
                    measured.rawVbat <= BAT_VALID_MAX_V);

  bool stable = plausible && (measured.spreadMv <= BAT_FLOAT_RANGE_MV);

  if (isColdBootUsbSuspect(measured, stable)) {
    if (g_batColdUsbSuspectStreak < 255) g_batColdUsbSuspectStreak++;

    if (g_batColdUsbSuspectStreak >= BAT_VALID_CONFIRM_COUNT) {
      g_batValidStreak = 0;
      if (g_batInvalidStreak < 255) g_batInvalidStreak++;
      markBatteryAbsentLikeUsb(measured, "USB_BOOT_HIGH");
      return;
    }
  } else {
    if (g_batColdUsbSuspectStreak > 0) g_batColdUsbSuspectStreak--;
  }

  if (g_batFloatReject && stable) {
    bool looksLikeReinsert = (g_batLastRealV > 0.0f) &&
                             (measured.rawVbat <= g_batLastRealV + BAT_REINSERT_DROP_V);

    if (!looksLikeReinsert) {
      g_batValidStreak = 0;
      if (g_batInvalidStreak < 255) g_batInvalidStreak++;
      markBatteryAbsentLikeUsb(measured, "FLOAT_LOCK");
      return;
    }

    if (g_batReinsertStreak < 255) g_batReinsertStreak++;

    if (g_batReinsertStreak < BAT_VALID_CONFIRM_COUNT) {
      markBatteryAbsentLikeUsb(measured, "REINSERT_CAND");
      return;
    }

    g_batFloatReject = false;
    g_batFloatRejectStreak = 0;
    g_batReinsertStreak = 0;
    g_batColdUsbSuspectStreak = 0;
    g_haveLastGoodBat = false;
    g_batDisplayPercent = -1;
  }

  if (stable && isImpossibleHighJump(measured)) {
    if (g_batFloatRejectStreak < 255) g_batFloatRejectStreak++;

    if (g_batFloatRejectStreak >= BAT_FLOAT_REJECT_STREAK) {
      g_batFloatReject = true;
      g_batReinsertStreak = 0;
      g_batValidStreak = 0;
      if (g_batInvalidStreak < 255) g_batInvalidStreak++;
      markBatteryAbsentLikeUsb(measured, "JUMP_FLOAT");
      return;
    }
  } else {
    if (g_batFloatRejectStreak > 0) g_batFloatRejectStreak--;
  }

  if (stable) {
    bool freshBattery = !g_haveLastGoodBat;

    if (g_batValidStreak < 255) g_batValidStreak++;
    g_batInvalidStreak = 0;

    measured.valid = true;

    float effectiveV = batteryEffectiveVoltageForPercent(measured.rawVbat, freshBattery);

