Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.14 inch LCD Display/ESP32-S3 Plus/0703_DashBoard_114_ESP32/0703_DashBoard_114_ESP32.ino
    if (g_haveLastGoodBat) {
      effectiveV = g_lastGoodBat.vbat * 0.88f + effectiveV * 0.12f;
    }

    measured.vbat = effectiveV;
    measured.percent = updatePresencePercent(lipoPercent(measured.vbat), freshBattery);

    if (g_batValidStreak >= BAT_VALID_CONFIRM_COUNT) {
      g_bat = measured;
      g_bat.state = g_batUsbInsertCompActive ? "BAT_USB_COMP" : "BAT_PRESENT";
      g_batFilterState = g_bat.state;

      g_lastGoodBat = g_bat;
      g_lastGoodBat.valid = true;
      g_haveLastGoodBat = true;

      g_batLastRealV = g_bat.vbat;
      g_batLastRealPercent = g_bat.percent;

      if (!g_batUsbOnlySeen) {
        g_batUsbInsertCompActive = false;
        g_batUsbInsertRawStartV = 0.0f;
      }
    } else if (g_haveLastGoodBat) {
      g_bat = g_lastGoodBat;
      g_bat.state = "BAT_HOLD";
      g_batFilterState = g_bat.state;
    } else {
      g_bat = measured;
      g_bat.state = "BAT_CAND";
      g_batFilterState = g_bat.state;
    }

    return;
  }

  g_batValidStreak = 0;
  if (g_batInvalidStreak < 255) g_batInvalidStreak++;

  if (!g_batFloatReject && g_haveLastGoodBat && g_batInvalidStreak < BAT_INVALID_CONFIRM_COUNT) {
    g_bat = g_lastGoodBat;
    g_bat.valid = true;
    g_bat.state = "BAT_HOLD";
    g_batFilterState = g_bat.state;
    return;
  }

  markBatteryAbsentLikeUsb(measured, plausible ? "FLOAT" : "USB_PWR");
}

static bool isUsbPowerTextMode() {
  return !g_bat.valid;
}

// ========================= MIC =========================

static void deinitMic() {
#if ESP_IDF_VERSION_MAJOR >= 5
  if (g_i2sRxChan) {
    i2s_channel_disable(g_i2sRxChan);
    i2s_del_channel(g_i2sRxChan);
    g_i2sRxChan = nullptr;
  }
#else
  i2s_driver_uninstall(I2S_PORT);
#endif
  g_micOk = false;
}

static bool initMic() {
  deinitMic();

#if ESP_IDF_VERSION_MAJOR >= 5
  i2s_chan_config_t chanCfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
  chanCfg.dma_desc_num = 4;
  chanCfg.dma_frame_num = MIC_SAMPLES_PER_READ;

  esp_err_t err = i2s_new_channel(&chanCfg, nullptr, &g_i2sRxChan);
  if (err != ESP_OK) {
    Serial.printf("[MIC] i2s_new_channel failed: %d\n", (int)err);
    return false;
  }

  i2s_pdm_rx_config_t pdmCfg = {};
  pdmCfg.clk_cfg = I2S_PDM_RX_CLK_DEFAULT_CONFIG(MIC_SAMPLE_RATE_HZ);
  pdmCfg.slot_cfg = I2S_PDM_RX_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_16BIT, I2S_SLOT_MODE_MONO);
  pdmCfg.gpio_cfg.clk = (gpio_num_t)MIC_CLK_PIN;
  pdmCfg.gpio_cfg.din = (gpio_num_t)MIC_DATA_PIN;
  pdmCfg.gpio_cfg.invert_flags.clk_inv = MIC_CLK_INVERT;

  err = i2s_channel_init_pdm_rx_mode(g_i2sRxChan, &pdmCfg);
  if (err != ESP_OK) {
    Serial.printf("[MIC] init_pdm failed: %d\n", (int)err);
    deinitMic();
    return false;
  }

#if REDUCE_PDM_CLK_DRIVE
  gpio_set_drive_capability((gpio_num_t)MIC_CLK_PIN, GPIO_DRIVE_CAP_0);
#endif

  err = i2s_channel_enable(g_i2sRxChan);
  if (err != ESP_OK) {
    Serial.printf("[MIC] enable failed: %d\n", (int)err);
    deinitMic();
    return false;
  }
#else
  i2s_config_t cfg = {};
  cfg.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_RX | I2S_MODE_PDM);
  cfg.sample_rate = MIC_SAMPLE_RATE_HZ;
  cfg.bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT;
  cfg.channel_format = I2S_CHANNEL_FMT_ONLY_LEFT;
  cfg.communication_format = I2S_COMM_FORMAT_I2S;
  cfg.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1;
  cfg.dma_buf_count = 4;
  cfg.dma_buf_len = MIC_SAMPLES_PER_READ;

  esp_err_t err = i2s_driver_install(I2S_PORT, &cfg, 0, nullptr);
  if (err != ESP_OK) return false;

  i2s_pin_config_t pins = {};
  pins.bck_io_num = I2S_PIN_NO_CHANGE;
  pins.ws_io_num = MIC_CLK_PIN;
  pins.data_out_num = I2S_PIN_NO_CHANGE;
  pins.data_in_num = MIC_DATA_PIN;

  if (i2s_set_pin(I2S_PORT, &pins) != ESP_OK) return false;
#endif

  g_micOk = true;
  Serial.println("[MIC] OK");
  return true;
}

static bool readMic(size_t *bytesRead, uint32_t timeoutMs) {
  *bytesRead = 0;

#if ESP_IDF_VERSION_MAJOR >= 5
  if (!g_i2sRxChan) return false;
  esp_err_t err = i2s_channel_read(g_i2sRxChan, g_pdmBuf, sizeof(g_pdmBuf), bytesRead, pdMS_TO_TICKS(timeoutMs));
#else
  esp_err_t err = i2s_read(I2S_PORT, g_pdmBuf, sizeof(g_pdmBuf), bytesRead, pdMS_TO_TICKS(timeoutMs));
#endif

  return (err == ESP_OK && *bytesRead > 0);
}

static AudioStats statsOf(const int16_t *samples, uint32_t count) {
  AudioStats s = {};
  if (!count) return s;

  int64_t sum = 0;
  for (uint32_t i = 0; i < count; i++) {
    sum += samples[i];
  }

  s.mean = (int32_t)(sum / count);

  uint32_t peak = 0;
  uint64_t sq = 0;
  for (uint32_t i = 0; i < count; i++) {
    int32_t v = (int32_t)samples[i] - s.mean;
    uint32_t a = v < 0 ? (uint32_t)(-v) : (uint32_t)v;
    if (a > peak) peak = a;
    sq += (uint64_t)a * a;
  }

  s.peak = peak;
  s.rms = (uint32_t)sqrt((double)sq / count);
  return s;
}

static void updateMic() {
  if (!g_micOk) return;

  size_t bytesRead = 0;
  if (!readMic(&bytesRead, 2)) return;

  uint32_t samples = bytesRead / sizeof(int16_t);
  if (samples > 0) {
    g_micStats = statsOf(g_pdmBuf, samples);
    g_micLastUpdateMs = millis();
  }
}

static uint32_t currentMicPeak() {
  uint32_t now = millis();

  if (now - g_micLastUpdateMs > 120) {
    g_micStats.peak = (uint32_t)(g_micStats.peak * 0.80f);
    g_micStats.rms = (uint32_t)(g_micStats.rms * 0.80f);
  }

  return g_micStats.peak;
}

// ========================= UI update =========================

static uint16_t vuColorForIndex(int i) {
  if (i >= 10) return C_RED;
  if (i >= 8) return C_ORANGE;
  if (i >= 6) return C_YELLOW;
  return C_GREEN;
}

static String voltageRowText(float d16, float calc) {
  char buf[32];
  // 20 chars exactly: compact enough to stay inside the SYS card.
  snprintf(buf, sizeof(buf), "D16 %.2fV|Calc %.2fV", d16, calc);
  return String(buf);
}

static void updateVu() {
  if (!g_lcdOk) return;

  float target = (float)currentMicPeak() / MIC_DISPLAY_SCALE;
  if (target < 0.0f) target = 0.0f;
  if (target > 1.0f) target = 1.0f;

  if (target > g_vuSmooth) {
    g_vuSmooth = g_vuSmooth * 0.50f + target * 0.50f;
  } else {
    g_vuSmooth = g_vuSmooth * 0.82f + target * 0.18f;
  }

  int segs = (int)roundf(g_vuSmooth * VU_SEG_COUNT);
  if (segs < 0) segs = 0;
  if (segs > VU_SEG_COUNT) segs = VU_SEG_COUNT;
  if (segs == g_cachedVuSegments) return;

  for (int i = 0; i < VU_SEG_COUNT; ++i) {
    int x = VU_X + 2 + i * (VU_SEG_W + VU_GAP);
    uint16_t c = (i < segs) ? vuColorForIndex(i) : C_BLACK;
    display.fillRect(x, VU_Y + 2, VU_SEG_W, VU_H - 4, c);
  }

  g_cachedVuSegments = segs;
}

static void updateUiFast() {
  char buf[64];

  // D16 voltage row:
  // Draw one compact row and clear the whole row area first. This avoids both
  // right-edge overflow and colored pixel residue from previous longer strings.
  if (millis() - g_lastVsenseUiMs >= VSENSE_UI_MS || cache_bat.length() == 0) {
    g_lastVsenseUiMs = millis();

    float d16Now = roundf(g_vsense.vadc * 100.0f) / 100.0f;
    float calcNow = roundf(g_vsense.rawVbat * 100.0f) / 100.0f;

    bool needDraw = cache_bat.length() == 0 ||
                    (g_d16ShownVadc < 0.0f) ||
                    (g_d16ShownCalc < 0.0f) ||
                    (fabsf(d16Now - g_d16ShownVadc) >= VSENSE_D16_DELTA_V) ||
                    (fabsf(calcNow - g_d16ShownCalc) >= VSENSE_CALC_DELTA_V);

