Seeed-Studio/Seeed_GFX2/examples/LCD Displays/Display Series/1.14 inch LCD Display/ESP32-S3 Plus/0703_DashBoard_114_ESP32/0703_DashBoard_114_ESP32.ino
    if (needDraw && g_lcdOk) {
      String rowText = voltageRowText(d16Now, calcNow);

      display.fillRect(VSENSE_ROW_X, ROW_BAT - 2, VSENSE_ROW_W, 14, C_BLACK);
      display.setTextSize(1);
      display.setTextColor(C_YELLOW, C_BLACK);
      display.setCursor(VSENSE_ROW_X, ROW_BAT);
      display.print(padRight(rowText, VSENSE_ROW_CHARS));

      cache_bat = rowText;
      cache_d16_adc = rowText;
      cache_d16_calc = rowText;
      g_d16ShownVadc = d16Now;
      g_d16ShownCalc = calcNow;
    }
  }

  // Voltage sense only: no BAT percentage, no USB PWR text, no battery icon.
  cache_batIconState = -1;

  String groveText;
  if (g_i2cCount == 0) {
    groveText = "none";
  } else {
    char t[24];
    snprintf(t, sizeof(t), "%u 0x%02X", g_i2cCount, g_i2cDevices[0]);
    groveText = String(t);
  }
  if (groveText != cache_grove) {
    cache_grove = groveText;
    printTextFixed(50, ROW_GROVE, C_CYAN, groveText, 11);
  }

  snprintf(buf, sizeof(buf), "%+.1f %+.1f %+.1f", g_ax, g_ay, g_az);
  String accText = g_imuOk ? String(buf) : String("not found");
  if (accText != cache_acc) {
    cache_acc = accText;
    printTextFixed(28, ROW_ACC, g_imuOk ? C_WHITE : C_RED, accText, 14);
  }

  snprintf(buf, sizeof(buf), "%+.0f %+.0f %+.0f", g_gx, g_gy, g_gz);
  String gyrText = g_imuOk ? String(buf) : String("not found");
  if (gyrText != cache_gyr) {
    cache_gyr = gyrText;
    printTextFixed(28, ROW_GYR, g_imuOk ? C_WHITE : C_RED, gyrText, 14);
  }

  String tapText = String("Tap ") + String(g_doubleTapCount);
  if (tapText != cache_tap) {
    cache_tap = tapText;
    printTextFixed(90, ROW_TAP, C_YELLOW, tapText, 6);
  }

  uint32_t peak = currentMicPeak();
  snprintf(buf, sizeof(buf), "Raw %u", (unsigned)peak);
  String micText = String(buf);
  if (micText != cache_micRaw) {
    cache_micRaw = micText;
    uint16_t rawColor = C_WHITE;
    if (peak > 1900) rawColor = C_RED;
    else if (peak > 1200) rawColor = C_ORANGE;
    printTextFixed(14, ROW_MIC_RAW, rawColor, micText, 18);
  }

  String blText = String("Brightness ") + String(currentBacklightPercent()) + "%";
  if (currentBacklightPwm() == 0) blText = "Brightness OFF";
  if (blText != cache_bl) {
    cache_bl = blText;
    uint16_t c = currentBacklightPwm() == 0 ? C_RED : C_CYAN;
    // Match the 1.47 Dashboard wording and keep it left-aligned in the card.
    printTextFixed(14, ROW_BL, c, blText, 18);
  }
}

static void printSerialStatus() {
  Serial.print("[DASH114_S3] mic=");
  Serial.print((unsigned)currentMicPeak());
  Serial.print(" acc=(");
  Serial.print(g_ax, 2); Serial.print(","); Serial.print(g_ay, 2); Serial.print(","); Serial.print(g_az, 2); Serial.print(")");
  Serial.print(" gyr=(");
  Serial.print(g_gx, 2); Serial.print(","); Serial.print(g_gy, 2); Serial.print(","); Serial.print(g_gz, 2); Serial.print(")");
  Serial.print(" i2c=");
  Serial.print((unsigned)g_i2cCount);
  Serial.print(" d16_adc=");
  Serial.print(g_vsense.vadc, 3);
  Serial.print("V calc=");
  Serial.print(g_vsense.rawVbat, 3);
  Serial.print("V raw=");
  Serial.print(g_vsense.raw);
  Serial.print(" mv=");
  Serial.print(g_vsense.mv);
  Serial.print(" spread=");
  Serial.print((unsigned)g_vsense.spreadMv);
  Serial.print(" vstate=");
  Serial.print(g_batFilterState);
  Serial.print(" tapCfg=");
  Serial.print(g_imuTapConfigured ? "Y" : "N");
  Serial.print(" tap=");
  Serial.print((unsigned long)g_doubleTapCount);
  Serial.print(" bl=");
  Serial.print((unsigned)currentBacklightPwm());
  Serial.print("/");
  Serial.print(currentBacklightPercent());
  Serial.print("%");
  Serial.print(" usr1=");
  Serial.print(g_btnA ? "P" : "R");
  Serial.print(" usr2=");
  Serial.print(g_btnB ? "P" : "R");
  Serial.print(" usr3=");
  Serial.println(g_btnC ? "P" : "R");
}

// ========================= Setup / loop =========================

static void printHeader() {
  Serial.println();
  Serial.println("=== XIAO ESP32-S3 Plus 1.14 Factory Dashboard v1.2.3 D16-compact-row ===");
  Serial.println("nRF52 visual parity + ESP32-S3 D16 voltage sense display.");
  Serial.printf("LCD: Seeed_GFX ST7789 %dx%d CS=D2(%d) DC=D3(%d) SCK=D8(%d) MOSI=D10(%d) RST=%d BL=%d\n",
                LCD_W, LCD_H,
                LCD_CS_PIN, LCD_DC_PIN, LCD_SCK_PIN, LCD_MOSI_PIN, LCD_RST_PIN, LCD_BL_PIN);
  Serial.printf("MIC: CLK=D0(%d), DATA=D1(%d), sample=%d\n",
                MIC_CLK_PIN, MIC_DATA_PIN, MIC_SAMPLE_RATE_HZ);
  Serial.printf("I2C: SDA=D4(%d), SCL=D5(%d), IMU_INT=D14(%d)\n",
                I2C_SDA_PIN, I2C_SCL_PIN, IMU_INT_PIN);
  Serial.printf("USR: USR1=D6(%d), USR2=D7(%d), USR3=D19(%d)\n",
                BTN_A_PIN, BTN_B_PIN, BTN_C_PIN);
}

void setup() {
  Serial.begin(115200);
  delay(900);

  WiFi.mode(WIFI_OFF);
  WiFi.disconnect(true);

  printHeader();

  pinMode(BTN_A_PIN, INPUT_PULLUP);
  pinMode(BTN_B_PIN, INPUT_PULLUP);
  pinMode(BTN_C_PIN, INPUT_PULLUP);

  g_btnARaw = digitalRead(BTN_A_PIN);
  g_btnBRaw = digitalRead(BTN_B_PIN);
  g_btnCRaw = digitalRead(BTN_C_PIN);
  g_btnALastRawPressed = (g_btnARaw == LOW);
  g_btnBLastRawPressed = (g_btnBRaw == LOW);
  g_btnCLastRawPressed = (g_btnCRaw == LOW);
  g_btnA = g_btnALastRawPressed;
  g_btnB = g_btnBLastRawPressed;
  g_btnC = g_btnCLastRawPressed;
  g_btnALastChangeMs = millis();
  g_btnBLastChangeMs = millis();
  g_btnCLastChangeMs = millis();

  pinMode(IMU_INT_PIN, INPUT_PULLUP);

  analogReadResolution(12);
#if defined(ADC_11db)
  analogSetPinAttenuation(BAT_ADC_PIN, ADC_11db);
#endif

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(400000);
  Wire.setTimeOut(8);      // short timeout: avoids long blocking during Grove hot-plug

  initLcd();
  drawStaticLayout();

  scanI2cBus();
  initImu();
  initMic();

  updateButtons();
  updateImu();
  updateMic();
  updateBattery();
  updateUiFast();
  updateVu();

  Serial.println("[BOOT] 1.14 ESP32-S3 dashboard v1.2.3 D16-compact-row ready");
}

void loop() {
  uint32_t now = millis();

  g_frameCounter++;

  handleImuTapEvent();
  updateButtons();
  handleButtonActions();
  updateMic();

  if (now - g_lastVuMs >= UI_VU_MS) {
    g_lastVuMs = now;
    updateVu();
  }

  if (now - g_lastFastUiMs >= UI_FAST_MS) {
    g_lastFastUiMs = now;
    updateUiFast();
  }

  if (now - g_lastSlowUiMs >= UI_SLOW_MS) {
    g_lastSlowUiMs = now;
    updateImu();
  }

  if (now - g_lastI2cMs >= I2C_SCAN_MS) {
    g_lastI2cMs = now;
    scanI2cBus();
  }

  if (now - g_lastBatMs >= BAT_REFRESH_MS) {
    g_lastBatMs = now;
    updateBattery();
  }

  if (now - g_lastSerialMs >= SERIAL_MS) {
    g_lastSerialMs = now;
    printSerialStatus();
  }

  delay(2);
}
